Hi,

> **suggestion**: The code `cidr_blocks = var.vpc.public_subnets_cidr_blocks` should be replaced with `cidr_blocks = [var.vpc.private_subnets_cidr_blocks, var.vpc.public_subnets_cidr_blocks]`

You may encounter the following error if you have an existing efs:
```
╷
│ Error: [WARN] A duplicate Security Group rule was found on (sg-007b65a92b80e94f7). This may be
│ a side effect of a now-fixed Terraform issue causing two security groups with
│ identical attributes but different source_security_group_ids to overwrite each
│ other in the state. See https://github.com/hashicorp/terraform/pull/2376 for more
│ information and instructions for recovery. Error: InvalidPermission.Duplicate: the specified rule "peer: 10.99.0.0/24, TCP, from port: 2049, to port: 2049, ALLOW" already exists
│       status code: 400, request id: 93807b23-8db0-4800-bcf4-54b737cb1f8b
│ 
│   with module.gigadb_efs.module.efs.aws_security_group_rule.this["vpc"],
│   on .terraform/modules/gigadb_efs.efs/main.tf line 180, in resource "aws_security_group_rule" "this":
│  180: resource "aws_security_group_rule" "this" {
│ 
╵
Releasing state lock. This may take a few moments...
```

The way to fix it is to destroy and recreate the efs as below:
```
% terraform destroy -target=module.gigadb_efs --auto-approve
% terraform apply -target=module.gigadb_efs --auto-approve
...
 # module.gigadb_efs.module.efs.aws_security_group_rule.this["vpc"] will be created
  + resource "aws_security_group_rule" "this" {
      + cidr_blocks              = [
          + "10.99.0.0/24",
          + "10.99.1.0/24",
          + "10.99.2.0/24",
          + "10.99.3.0/24",
          + "10.99.4.0/24",
          + "10.99.5.0/24",
        ]
      + description              = "NFS ingress from VPC subnets"
      + from_port                = 2049
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 2049
      + type                     = "ingress"
    }

Plan: 9 to add, 0 to change, 0 to destroy.
...


